# IFCParameter Template Import Property Setup From File Method

Source: https://www.revitapidocs.com/2026/b7fa7de9-9c18-252e-046c-ab1e3c39edda.htm

---

| IFCParameter Template Import Property Setup From File Method |
| --- |

Imports mapping information from a text file.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ImportPropertySetupFromFile(
	string fileName
)
```

```
Public Sub ImportPropertySetupFromFile (
	fileName As String
)
```

```
public:
void ImportPropertySetupFromFile(
	String^ fileName
)
```

```
member ImportPropertySetupFromFile :
        fileName : string -> unit
```

#### Parameters

fileName String
:   The full text file name.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| FileAccessException | Failed to access the text file. |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace